ISUSim2D/system/blockMeshDict_Coarse
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

single 3; //Single cell (column) width

leftX 60; //Fan duct x

fsX 60; //Free stream region x

lcolX 15; //Left column x
mcolX 50; //Middle column x
rcolX 15; //Right column x

triY 7; //Triangle y

botY 35; // Bottom section y
midY 80; //Middle section y
topY 80; //Top Section y
topmY 60; //Top middle section y

outfd 15; //Outflow duct width
outfdtopx 80; //Outflow duct top x
outfdtally 160; //Outflow duct tall section y
slantW 60; // outflow duct slanted section y


vertices
(
	(0 0 0) //0
	(0.914 0 0)
	(0.914 0.71 0)
	(0 0.71 0)
	(0 0 0.1)
	(0.914 0 0.1) //5
	(0.914 0.71 0.1)
	(0 0.71 0.1)
	(0.914 2.234 0)
	(0 2.234 0)
	(0.914 2.234 0.1) //10
	(0 2.234 0.1)
	(0.964 0 0)
	(0.964 0.71 0)
	(0.964 0 0.1)
	(0.964 0.71 0.1) //15
	(0.964 2.234 0)
	(0.964 2.234 0.1)
	(0.914 3.783 0)
	(0 3.783 0)
	(0.914 3.783 0.1) //20
	(0 3.783 0.1)
	(1.269 0 0)
	(1.269 0.71 0)
	(1.269 0 0.1)
	(1.269 0.71 0.1) //25
	(1.269 2.234 0)
	(1.269 2.234 0.1)
	(1.269 3.453 0)
	(0.964 3.453 0)
	(1.269 3.453 0.1) //30
	(0.964 3.453 0.1)
	(1.269 3.758 0)
	(1.269 3.758 0.1)
	(2.133 3.453 0)
	(2.133 3.758 0) //35
	(2.133 3.453 0.1)
	(2.133 3.758 0.1)
	(2.133 2.234 0)
	(2.133 2.234 0.1)
	(2.133 0.71 0) //40
	(2.133 0.71 0.1)
	(2.133 0 0)
	(2.133 0 0.1)
	(2.438 0 0)
	(2.438 0.71 0) //45
	(2.438 0 0.1)
	(2.438 0.71 0.1)
	(2.438 2.234 0)
	(2.438 2.234 0.1)
	(2.438 3.453 0) //50
	(2.438 3.453 0.1)
	(2.488 0 0)
	(2.488 0.71 0)
	(2.488 0 0.1)
	(2.488 0.71 0.1) //55
	(2.743 0 0)
	(2.743 0.71 0)
	(2.743 0 0.1)
	(2.743 0.71 0.1)
	(0.914 4.063 0) //60
	(0 4.063 0)
	(0.914 4.063 0.1)
	(0 4.063 0.1)
	(2.134 3.783 0)
	(2.134 4.063 0) //65
	(2.134 3.783 0.1)
	(2.134 4.063 0.1)
	(2.488 3.463 0)
	(2.743 3.463 0)
	(2.488 3.463 0.1) //70
	(2.743 3.463 0.1)
	(2.793 0 0)
	(2.793 0.71 0)
	(2.793 0 0.1)
	(2.793 0.71 0.1) //75
	(6 0 0)
	(6 0.71 0)
	(6 0 0.1)
	(6 0.71 0.1)
	(2.793 2.5 0) //80
	(6 2.5 0)
	(2.793 2.5 0.1)
	(6 2.5 .1)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($leftX $botY 1) simpleGrading (1 1 1)
    hex (3 2 8 9 7 6 10 11) ($leftX $midY 1) simpleGrading (1 1 1)
    hex (1 12 13 2 5 14 15 6) ($single $botY 1) simpleGrading (1 1 1)
    hex (2 13 16 8 6 15 17 10) ($single $midY 1) simpleGrading (1 1 1)
    hex (9 8 18 19 11 10 20 21) ($leftX $topY 1) simpleGrading (1 1 1)
    hex (12 22 23 13 14 24 25 15) ($lcolX $botY 1) simpleGrading (1 1 1)
    hex (13 23 26 16 15 25 27 17) ($lcolX $midY 1) simpleGrading (1 1 1)
    hex (16 26 28 29 17 27 30 31) ($lcolX $topmY 1) simpleGrading (1 1 1)
    hex (26 38 34 28 27 39 36 30) ($mcolX $topmY 1) simpleGrading (1 1 1)
    hex (23 40 38 26 25 41 39 27) ($mcolX $midY 1) simpleGrading (1 1 1)
    hex (22 42 40 23 24 43 41 25) ($mcolX $botY 1) simpleGrading (1 1 1)
    hex (42 44 45 40 43 46 47 41) ($rcolX $botY 1) simpleGrading (1 1 1)
    hex (40 45 48 38 41 47 49 39) ($rcolX $midY 1) simpleGrading (1 1 1)
    hex (38 48 50 34 39 49 51 36) ($rcolX $topmY 1) simpleGrading (1 1 1)
    hex (44 52 53 45 46 54 55 47) ($single $botY 1) simpleGrading (1 1 1)
    hex (52 56 57 53 54 58 59 55) ($outfd $botY 1) simpleGrading (1 1 1)
    hex (19 18 60 61 21 20 62 63) ($leftX $outfd 1) simpleGrading (1 1 1)
    hex (18 64 65 60 20 66 67 62) ($outfdtopx $outfd 1) simpleGrading (1 1 1)
    hex (64 68 69 65 66 70 71 67) ($slantW $outfd 1) simpleGrading (1 1 1)
    hex (53 57 69 68 55 59 71 70) ($outfd $outfdtally 1) simpleGrading (1 1 1)
    hex (56 72 73 57 58 74 75 59) ($single $botY 1) simpleGrading (1 1 1)
    hex (72 76 77 73 74 78 79 75) ($fsX $botY 1) simpleGrading (1 1 1)
    hex (73 77 81 80 75 79 83 82) ($fsX $botY 1) simpleGrading (1 1 1)
	
    //hex (29 28 32 32 31 30 33 33) ($lcolX $triY 1) simpleGrading (1 1 1)
    //hex (28 34 35 32 30 36 37 33) ($mcolX $triY 1) simpleGrading (1 1 1)
    //hex (34 50 35 35 36 51 37 37) ($rcolX $triY 1) simpleGrading (1 1 1)
	
);

edges
(
	spline 64 68
	(
		(2.134 3.783 0)
		(2.141115396388124 3.782967350270381 0)
		(2.148158555249464 3.782869401081522 0)
		(2.155129476584022 3.7827061524334256 0)
		(2.1620281603917966 3.782477604326089 0)
		(2.1688546066727885 3.7821837567595145 0)
		(2.1756088154269975 3.781824609733701 0)
		(2.182290786654423 3.781400163248648 0)
		(2.188900520355066 3.780910417304357 0)
		(2.1954380165289256 3.7803553719008263 0)
		(2.2019032751760026 3.779735027038057 0)
		(2.208296296296296 3.7790493827160487 0)
		(2.2146170798898073 3.778298438934802 0)
		(2.2208656259565354 3.7774821956943176 0)
		(2.2270419344964796 3.7766006529945924 0)
		(2.233146005509642 3.77565381083563 0)
		(2.2391778389960204 3.7746416692174267 0)
		(2.2451374349556166 3.7735642281399855 0)
		(2.2510247933884293 3.772421487603305 0)
		(2.25683991429446 3.771213447607387 0)
		(2.2625827976737067 3.7699401081522295 0)
		(2.268253443526171 3.7686014692378325 0)
		(2.273851851851852 3.7671975308641974 0)
		(2.2793780226507496 3.7657282930313234 0)
		(2.284831955922865 3.7641937557392104 0)
		(2.290213651668197 3.762593918987858 0)
		(2.295523109886746 3.7609287827772677 0)
		(2.3007603305785125 3.7591983471074384 0)
		(2.3059253137434954 3.7574026119783697 0)
		(2.311018059381696 3.755541577390062 0)
		(2.316038567493113 3.7536152433425163 0)
		(2.320986838077747 3.7516236098357307 0)
		(2.325862871135598 3.7495666768697067 0)
		(2.3306666666666667 3.7474444444444446 0)
		(2.3353982246709517 3.7452569125599435 0)
		(2.340057545148454 3.743004081216202 0)
		(2.3446446280991733 3.7406859504132233 0)
		(2.34915947352311 3.7383025201510054 0)
		(2.353602081420263 3.7358537904295477 0)
		(2.3579724517906335 3.7333397612488515 0)
		(2.362270584634221 3.730760432608917 0)
		(2.3664964799510257 3.728115804509744 0)
		(2.3706501377410465 3.7254058769513314 0)
		(2.374731558004285 3.7226306499336803 0)
		(2.378740740740741 3.7197901234567907 0)
		(2.382677685950413 3.716884297520661 0)
		(2.3865423936333023 3.713913172125293 0)
		(2.390334863789409 3.710876747270687 0)
		(2.394055096418733 3.707775022956841 0)
		(2.397703091521273 3.7046079991837564 0)
		(2.401278849097031 3.7013756759514336 0)
		(2.4047823691460053 3.698078053259872 0)
		(2.408213651668197 3.6947151311090707 0)
		(2.4115726966636055 3.69128690949903 0)
		(2.4148595041322314 3.687793388429752 0)
		(2.418074074074074 3.6842345679012345 0)
		(2.4212164064891337 3.6806104479134785 0)
		(2.4242865013774106 3.676921028466483 0)
		(2.427284358738904 3.6731663095602487 0)
		(2.430209978573615 3.669346291194776 0)
		(2.4330633608815426 3.665460973370064 0)
		(2.435844505662687 3.6615103560861133 0)
		(2.438553412917049 3.657494439342924 0)
		(2.4411900826446282 3.653413223140496 0)
		(2.443754514845424 3.6492667074788283 0)
		(2.446246709519437 3.6450548923579227 0)
		(2.448666666666667 3.6407777777777777 0)
		(2.4510143862871137 3.636435363738394 0)
		(2.4532898683807773 3.6320276502397713 0)
		(2.455493112947658 3.62755463728191 0)
		(2.4576241199877567 3.6230163248648095 0)
		(2.459682889501071 3.6184127129884707 0)
		(2.461669421487603 3.6137438016528924 0)
		(2.4635837159473524 3.6090095908580757 0)
		(2.465425772880318 3.60421008060402 0)
		(2.4671955922865014 3.5993452708907254 0)
		(2.4688931741659017 3.594415161718192 0)
		(2.4705185185185186 3.58941975308642 0)
		(2.472071625344353 3.5843590449954084 0)
		(2.4735524946434033 3.579233037445158 0)
		(2.474961126415672 3.5740417304356695 0)
		(2.4762975206611575 3.568785123966942 0)
		(2.477561677379859 3.563463218038976 0)
		(2.4787535965717784 3.55807601265177 0)
		(2.479873278236915 3.5526235078053263 0)
		(2.480920722375268 3.547105703499643 0)
		(2.4818959289868383 3.5415225997347215 0)
		(2.4827988980716253 3.53587419651056 0)
		(2.4836296296296294 3.5301604938271605 0)
		(2.484388123660851 3.524381491684522 0)
		(2.4850743801652895 3.5185371900826445 0)
		(2.4856883991429446 3.5126275890215286 0)
		(2.486230180593817 3.5066526885011733 0)
		(2.4866997245179063 3.5006124885215795 0)
		(2.4870970309152125 3.4945069890827467 0)
		(2.487422099785736 3.4883361901846754 0)
		(2.487674931129477 3.482100091827365 0)
		(2.487855524946434 3.475798694010815 0)
		(2.4879638812366087 3.469431996735027 0)
		(2.488 3.463 0)
	)
	
	spline 65 69
	(
		(2.134 4.063 0)
		(2.1462408937863486 4.062938781756964 0)
		(2.1583575145393326 4.062755127027854 0)
		(2.1703498622589534 4.062449035812673 0)
		(2.1822179369452095 4.0620205081114165 0)
		(2.193961738598102 4.061469543924089 0)
		(2.2055812672176307 4.0607961432506885 0)
		(2.2170765228037954 4.060000306091215 0)
		(2.228447505356596 4.059082032445669 0)
		(2.239694214876033 4.058041322314049 0)
		(2.250816651362106 4.056878175696357 0)
		(2.2618148148148145 4.055592592592592 0)
		(2.2726887052341596 4.054184573002754 0)
		(2.283438322620141 4.052654116926845 0)
		(2.2940636669727574 4.05100122436486 0)
		(2.304564738292011 4.0492258953168045 0)
		(2.3149415365779 4.047328129782675 0)
		(2.3251940618304254 4.045307927762473 0)
		(2.3353223140495865 4.043165289256198 0)
		(2.3453262932353844 4.040900214263851 0)
		(2.3552059993878176 4.038512702785431 0)
		(2.3649614325068873 4.036002754820936 0)
		(2.3745925925925926 4.0333703703703705 0)
		(2.384099479644934 4.030615549433731 0)
		(2.393482093663912 4.027738292011019 0)
		(2.402740434649525 4.024738598102234 0)
		(2.4118745026017754 4.021616467707377 0)
		(2.4208842975206615 4.0183719008264465 0)
		(2.429769819406183 4.015004897459443 0)
		(2.4385310682583405 4.011515457606366 0)
		(2.4471680440771353 4.007903581267218 0)
		(2.4556807468625648 4.004169268441995 0)
		(2.4640691766146308 4.0003125191307 0)
		(2.4723333333333333 3.9963333333333333 0)
		(2.4804732170186714 3.992231711049893 0)
		(2.4884888276706456 3.988007652280379 0)
		(2.496380165289256 3.9836611570247933 0)
		(2.5041472298745027 3.9791922252831347 0)
		(2.511790021426385 3.9746008570554023 0)
		(2.5193085399449036 3.969887052341597 0)
		(2.526702785430058 3.9650508111417198 0)
		(2.533972757881849 3.96009213345577 0)
		(2.5411184573002754 3.955011019283746 0)
		(2.548139883685338 3.94980746862565 0)
		(2.5550370370370374 3.944481481481482 0)
		(2.561809917355372 3.939033057851239 0)
		(2.5684585246403424 3.9334621977349244 0)
		(2.57498285889195 3.9277689011325374 0)
		(2.581382920110193 3.9219531680440767 0)
		(2.5876587082950717 3.916014998469543 0)
		(2.593810223446587 3.9099543924089373 0)
		(2.5998374655647387 3.9037713498622586 0)
		(2.6057404346495256 3.8974658708295076 0)
		(2.611519130700949 3.891037955310682 0)
		(2.6171735537190086 3.884487603305785 0)
		(2.6227037037037038 3.8778148148148146 0)
		(2.6281095806550354 3.871019589837772 0)
		(2.6333911845730027 3.864101928374655 0)
		(2.638548515457606 3.8570618304254665 0)
		(2.6435815733088464 3.849899295990205 0)
		(2.6484903581267214 3.8426143250688702 0)
		(2.6532748699112334 3.8352069176614627 0)
		(2.657935108662381 3.8276770737679824 0)
		(2.662471074380165 3.8200247933884297 0)
		(2.666882767064585 3.8122500765228033 0)
		(2.671170186715641 3.8043529231711046 0)
		(2.6753333333333336 3.796333333333333 0)
		(2.6793722069176615 3.788191307009489 0)
		(2.6832868074686256 3.7799268441995713 0)
		(2.687077134986226 3.771539944903581 0)
		(2.6907431894704623 3.7630306091215178 0)
		(2.6942849709213346 3.754398836853382 0)
		(2.6977024793388424 3.745644628099173 0)
		(2.7009957147229877 3.7367679828588916 0)
		(2.704164677073768 3.7277689011325372 0)
		(2.7072093663911847 3.71864738292011 0)
		(2.7101297826752373 3.70940342822161 0)
		(2.7129259259259255 3.700037037037037 0)
		(2.7155977961432507 3.6905482093663906 0)
		(2.718145393327211 3.6809369452096723 0)
		(2.7205687174778084 3.6712032445668807 0)
		(2.7228677685950413 3.6613471074380164 0)
		(2.7250425466789103 3.6513685338230792 0)
		(2.727093051729415 3.6412675237220693 0)
		(2.7290192837465566 3.631044077134986 0)
		(2.7308212427303338 3.62069819406183 0)
		(2.732498928680747 3.610229874502602 0)
		(2.734052341597796 3.5996391184573002 0)
		(2.735481481481481 3.588925925925926 0)
		(2.736786348331803 3.5780902969084787 0)
		(2.7379669421487605 3.5671322314049587 0)
		(2.7390232629323537 3.556051729415366 0)
		(2.7399553106825834 3.5448487909397 0)
		(2.7407630853994487 3.5335234159779616 0)
		(2.7414465870829505 3.52207560453015 0)
		(2.7420058157330884 3.5105053565962656 0)
		(2.7424407713498624 3.498812672176309 0)
		(2.742751453933272 3.486997551270279 0)
		(2.742937863483318 3.4750599938781757 0)
		(2.743 3.463 0)
	)
	
	spline 66 70
	(
		(2.134 3.783 0.1)
		(2.141115396388124 3.782967350270381 0.1)
		(2.148158555249464 3.782869401081522 0.1)
		(2.155129476584022 3.7827061524334256 0.1)
		(2.1620281603917966 3.782477604326089 0.1)
		(2.1688546066727885 3.7821837567595145 0.1)
		(2.1756088154269975 3.781824609733701 0.1)
		(2.182290786654423 3.781400163248648 0.1)
		(2.188900520355066 3.780910417304357 0.1)
		(2.1954380165289256 3.7803553719008263 0.1)
		(2.2019032751760026 3.779735027038057 0.1)
		(2.208296296296296 3.7790493827160487 0.1)
		(2.2146170798898073 3.778298438934802 0.1)
		(2.2208656259565354 3.7774821956943176 0.1)
		(2.2270419344964796 3.7766006529945924 0.1)
		(2.233146005509642 3.77565381083563 0.1)
		(2.2391778389960204 3.7746416692174267 0.1)
		(2.2451374349556166 3.7735642281399855 0.1)
		(2.2510247933884293 3.772421487603305 0.1)
		(2.25683991429446 3.771213447607387 0.1)
		(2.2625827976737067 3.7699401081522295 0.1)
		(2.268253443526171 3.7686014692378325 0.1)
		(2.273851851851852 3.7671975308641974 0.1)
		(2.2793780226507496 3.7657282930313234 0.1)
		(2.284831955922865 3.7641937557392104 0.1)
		(2.290213651668197 3.762593918987858 0.1)
		(2.295523109886746 3.7609287827772677 0.1)
		(2.3007603305785125 3.7591983471074384 0.1)
		(2.3059253137434954 3.7574026119783697 0.1)
		(2.311018059381696 3.755541577390062 0.1)
		(2.316038567493113 3.7536152433425163 0.1)
		(2.320986838077747 3.7516236098357307 0.1)
		(2.325862871135598 3.7495666768697067 0.1)
		(2.3306666666666667 3.7474444444444446 0.1)
		(2.3353982246709517 3.7452569125599435 0.1)
		(2.340057545148454 3.743004081216202 0.1)
		(2.3446446280991733 3.7406859504132233 0.1)
		(2.34915947352311 3.7383025201510054 0.1)
		(2.353602081420263 3.7358537904295477 0.1)
		(2.3579724517906335 3.7333397612488515 0.1)
		(2.362270584634221 3.730760432608917 0.1)
		(2.3664964799510257 3.728115804509744 0.1)
		(2.3706501377410465 3.7254058769513314 0.1)
		(2.374731558004285 3.7226306499336803 0.1)
		(2.378740740740741 3.7197901234567907 0.1)
		(2.382677685950413 3.716884297520661 0.1)
		(2.3865423936333023 3.713913172125293 0.1)
		(2.390334863789409 3.710876747270687 0.1)
		(2.394055096418733 3.707775022956841 0.1)
		(2.397703091521273 3.7046079991837564 0.1)
		(2.401278849097031 3.7013756759514336 0.1)
		(2.4047823691460053 3.698078053259872 0.1)
		(2.408213651668197 3.6947151311090707 0.1)
		(2.4115726966636055 3.69128690949903 0.1)
		(2.4148595041322314 3.687793388429752 0.1)
		(2.418074074074074 3.6842345679012345 0.1)
		(2.4212164064891337 3.6806104479134785 0.1)
		(2.4242865013774106 3.676921028466483 0.1)
		(2.427284358738904 3.6731663095602487 0.1)
		(2.430209978573615 3.669346291194776 0.1)
		(2.4330633608815426 3.665460973370064 0.1)
		(2.435844505662687 3.6615103560861133 0.1)
		(2.438553412917049 3.657494439342924 0.1)
		(2.4411900826446282 3.653413223140496 0.1)
		(2.443754514845424 3.6492667074788283 0.1)
		(2.446246709519437 3.6450548923579227 0.1)
		(2.448666666666667 3.6407777777777777 0.1)
		(2.4510143862871137 3.636435363738394 0.1)
		(2.4532898683807773 3.6320276502397713 0.1)
		(2.455493112947658 3.62755463728191 0.1)
		(2.4576241199877567 3.6230163248648095 0.1)
		(2.459682889501071 3.6184127129884707 0.1)
		(2.461669421487603 3.6137438016528924 0.1)
		(2.4635837159473524 3.6090095908580757 0.1)
		(2.465425772880318 3.60421008060402 0.1)
		(2.4671955922865014 3.5993452708907254 0.1)
		(2.4688931741659017 3.594415161718192 0.1)
		(2.4705185185185186 3.58941975308642 0.1)
		(2.472071625344353 3.5843590449954084 0.1)
		(2.4735524946434033 3.579233037445158 0.1)
		(2.474961126415672 3.5740417304356695 0.1)
		(2.4762975206611575 3.568785123966942 0.1)
		(2.477561677379859 3.563463218038976 0.1)
		(2.4787535965717784 3.55807601265177 0.1)
		(2.479873278236915 3.5526235078053263 0.1)
		(2.480920722375268 3.547105703499643 0.1)
		(2.4818959289868383 3.5415225997347215 0.1)
		(2.4827988980716253 3.53587419651056 0.1)
		(2.4836296296296294 3.5301604938271605 0.1)
		(2.484388123660851 3.524381491684522 0.1)
		(2.4850743801652895 3.5185371900826445 0.1)
		(2.4856883991429446 3.5126275890215286 0.1)
		(2.486230180593817 3.5066526885011733 0.1)
		(2.4866997245179063 3.5006124885215795 0.1)
		(2.4870970309152125 3.4945069890827467 0.1)
		(2.487422099785736 3.4883361901846754 0.1)
		(2.487674931129477 3.482100091827365 0.1)
		(2.487855524946434 3.475798694010815 0.1)
		(2.4879638812366087 3.469431996735027 0.1)
		(2.488 3.463 0.1)
	)
	
	spline 67 71
	(
		(2.134 4.063 0.1)
		(2.1462408937863486 4.062938781756964 0.1)
		(2.1583575145393326 4.062755127027854 0.1)
		(2.1703498622589534 4.062449035812673 0.1)
		(2.1822179369452095 4.0620205081114165 0.1)
		(2.193961738598102 4.061469543924089 0.1)
		(2.2055812672176307 4.0607961432506885 0.1)
		(2.2170765228037954 4.060000306091215 0.1)
		(2.228447505356596 4.059082032445669 0.1)
		(2.239694214876033 4.058041322314049 0.1)
		(2.250816651362106 4.056878175696357 0.1)
		(2.2618148148148145 4.055592592592592 0.1)
		(2.2726887052341596 4.054184573002754 0.1)
		(2.283438322620141 4.052654116926845 0.1)
		(2.2940636669727574 4.05100122436486 0.1)
		(2.304564738292011 4.0492258953168045 0.1)
		(2.3149415365779 4.047328129782675 0.1)
		(2.3251940618304254 4.045307927762473 0.1)
		(2.3353223140495865 4.043165289256198 0.1)
		(2.3453262932353844 4.040900214263851 0.1)
		(2.3552059993878176 4.038512702785431 0.1)
		(2.3649614325068873 4.036002754820936 0.1)
		(2.3745925925925926 4.0333703703703705 0.1)
		(2.384099479644934 4.030615549433731 0.1)
		(2.393482093663912 4.027738292011019 0.1)
		(2.402740434649525 4.024738598102234 0.1)
		(2.4118745026017754 4.021616467707377 0.1)
		(2.4208842975206615 4.0183719008264465 0.1)
		(2.429769819406183 4.015004897459443 0.1)
		(2.4385310682583405 4.011515457606366 0.1)
		(2.4471680440771353 4.007903581267218 0.1)
		(2.4556807468625648 4.004169268441995 0.1)
		(2.4640691766146308 4.0003125191307 0.1)
		(2.4723333333333333 3.9963333333333333 0.1)
		(2.4804732170186714 3.992231711049893 0.1)
		(2.4884888276706456 3.988007652280379 0.1)
		(2.496380165289256 3.9836611570247933 0.1)
		(2.5041472298745027 3.9791922252831347 0.1)
		(2.511790021426385 3.9746008570554023 0.1)
		(2.5193085399449036 3.969887052341597 0.1)
		(2.526702785430058 3.9650508111417198 0.1)
		(2.533972757881849 3.96009213345577 0.1)
		(2.5411184573002754 3.955011019283746 0.1)
		(2.548139883685338 3.94980746862565 0.1)
		(2.5550370370370374 3.944481481481482 0.1)
		(2.561809917355372 3.939033057851239 0.1)
		(2.5684585246403424 3.9334621977349244 0.1)
		(2.57498285889195 3.9277689011325374 0.1)
		(2.581382920110193 3.9219531680440767 0.1)
		(2.5876587082950717 3.916014998469543 0.1)
		(2.593810223446587 3.9099543924089373 0.1)
		(2.5998374655647387 3.9037713498622586 0.1)
		(2.6057404346495256 3.8974658708295076 0.1)
		(2.611519130700949 3.891037955310682 0.1)
		(2.6171735537190086 3.884487603305785 0.1)
		(2.6227037037037038 3.8778148148148146 0.1)
		(2.6281095806550354 3.871019589837772 0.1)
		(2.6333911845730027 3.864101928374655 0.1)
		(2.638548515457606 3.8570618304254665 0.1)
		(2.6435815733088464 3.849899295990205 0.1)
		(2.6484903581267214 3.8426143250688702 0.1)
		(2.6532748699112334 3.8352069176614627 0.1)
		(2.657935108662381 3.8276770737679824 0.1)
		(2.662471074380165 3.8200247933884297 0.1)
		(2.666882767064585 3.8122500765228033 0.1)
		(2.671170186715641 3.8043529231711046 0.1)
		(2.6753333333333336 3.796333333333333 0.1)
		(2.6793722069176615 3.788191307009489 0.1)
		(2.6832868074686256 3.7799268441995713 0.1)
		(2.687077134986226 3.771539944903581 0.1)
		(2.6907431894704623 3.7630306091215178 0.1)
		(2.6942849709213346 3.754398836853382 0.1)
		(2.6977024793388424 3.745644628099173 0.1)
		(2.7009957147229877 3.7367679828588916 0.1)
		(2.704164677073768 3.7277689011325372 0.1)
		(2.7072093663911847 3.71864738292011 0.1)
		(2.7101297826752373 3.70940342822161 0.1)
		(2.7129259259259255 3.700037037037037 0.1)
		(2.7155977961432507 3.6905482093663906 0.1)
		(2.718145393327211 3.6809369452096723 0.1)
		(2.7205687174778084 3.6712032445668807 0.1)
		(2.7228677685950413 3.6613471074380164 0.1)
		(2.7250425466789103 3.6513685338230792 0.1)
		(2.727093051729415 3.6412675237220693 0.1)
		(2.7290192837465566 3.631044077134986 0.1)
		(2.7308212427303338 3.62069819406183 0.1)
		(2.732498928680747 3.610229874502602 0.1)
		(2.734052341597796 3.5996391184573002 0.1)
		(2.735481481481481 3.588925925925926 0.1)
		(2.736786348331803 3.5780902969084787 0.1)
		(2.7379669421487605 3.5671322314049587 0.1)
		(2.7390232629323537 3.556051729415366 0.1)
		(2.7399553106825834 3.5448487909397 0.1)
		(2.7407630853994487 3.5335234159779616 0.1)
		(2.7414465870829505 3.52207560453015 0.1)
		(2.7420058157330884 3.5105053565962656 0.1)
		(2.7424407713498624 3.498812672176309 0.1)
		(2.742751453933272 3.486997551270279 0.1)
		(2.742937863483318 3.4750599938781757 0.1)
		(2.743 3.463 0.1)
	)
);

boundary
(
	atmosphere
	{
		type inlet;
		faces
		(
			(76 78 79 77)
			(77 79 83 81)
			(80 82 83 81)
		);
	}
    ground
    {
        type wall;
        faces
        (
            (1 0 4 5)
			(12 1 5 14)
			(12 14 24 22)
			(22 24 43 42)
			(42 43 46 44)
			(44 46 54 52)
			(52 54 58 56)
			(72 74 78 76)
			(56 58 74 72)
        );
    }
    walls
    {
        type wall;
        faces
        (
			(16 8 10 17)
			(8 18 20 10)
			(16 29 31 17)
			(49 48 45 47)
			(48 49 51 50)
			(45 53 55 47)
			(60 62 63 61)
			(18 20 66 64)
			(69 57 59 71)
			(53 68 70 55)
			(57 73 75 59)
			(65 67 62 60)
			(64 66 70 68)
			(65 67 71 69)
			(73 80 82 75)
			
			// If top tris present
			//(29 32 33 31)
			//(35 37 33 32)
			//(35 37 50 51)
			
			// If top tris gone
			(29 28 30 31)
			(28 34 36 30)
			(34 50 51 36)
        );
    }
	symPlane
	{
		type symmetryPlane;
		faces
		(
			(0 3 7 4)
			(9 11 7 3)
			(9 19 21 11)
			(19 61 63 21)
		);
	}
);

mergePatchPairs
(
);

// ************************************************************************* //
