ISUSim2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PBiCGStab;
        preconditioner  DIC;
		//smoother		GaussSeidel;
        tolerance       1e-08;
        relTol          0.5;
    }

    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0.8;
    }

}

SIMPLE
{
	nNonOrthogonalCorrectors 0;
	
	residualControl
	{
		p				1e-4;
		U				1e-5;
		"(k|omega)"		1e-4;
	}
}

relaxationFactors
{
    fields
    {
        p               0.25;
    }
    equations
    {
        "(U|k|omega)"   0.75;
    }
}

cache
{
    grad(U);
}



// ************************************************************************* //
