ISUSim2D/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volVectorFieldValue U (0 0 0)
	volScalarFieldValue p 1
);

expressions
(
    U
    {
        field       U;
        dimensions  [0 1 -1 0 0 0 0];

        constants
        {
            
        }

        variables
        (
			"magScale = 1"
        );


		// Upward Section
		condition
        //fieldMask
        #{
            //pos().x() < 2.745
			pos().x() < 0.92//0.93
        #};

        expression
        #{
			vector(0, 0.01, 0)
			/*
            vector(
			-0.1*magScale*cos(1.1*pos().y()-1)*((cos(1.8*pos().y()-1.2)+1)*(cos(1.8*pos().y()-1.2)+1)*(cos(1.8*pos().y()-1.2)+1)*(cos(1.8*pos().y()-1.2)+1))
			,
			-0.07*magScale*sin(1.5*pos().x()-2)*((cos(2.4*pos().x()-1.2)+1)*(cos(2.4*pos().x()-1.2)+1)*(cos(2.4*pos().x()-1.2)+1)*(cos(2.4*pos().x()-1.2)+1))
			,0)
			*/
        #};
	}
	
	p
	{
		field       p;
        dimensions  [0 2 -2 0 0 0 0];

        constants
        {
            
        }

        variables
        (
			"magScale = 10"
        );
		
		condition
		//fieldMask
        #{
            (pos().x() < 0.94 && pos().y() > 2.45) || (pos().x() < 2.15 && pos().y() > 3.5)
        #};
		
		expression
		#{
			(-exp(0.29*pos().x()*pos().x() - 1) + 1.4)*(-(1.2*pos().y()-3.9)*(1.2*pos().y()-3.9)*(1.2*pos().y()-3.9)*(1.2*pos().y()-3.9)+1)
		#};
		
	}
	
	
	
);


// ************************************************************************* //
