ISUSim2D/Allrun
#!/bin/bash

blockMesh

setExprFields

topoSet

decomposePar

mpirun -np 16 simpleFoam -parallel
